In [1]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

In [2]:
from IPython.core.interactiveshell import InteractiveShell

In [3]:
InteractiveShell.ast_node_interactivity = 'all'

## Group By mechanics

In [7]:
df = DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                'key2' : ['one', 'two', 'one', 'two', 'one'],
                'data1' : np.random.randint(10, size=5),
                'data2' : np.random.randint(10, size=5)})
df

   data1  data2 key1 key2
0      3      5    a  one
1      5      2    a  two
2      7      5    b  one
3      3      3    b  two
4      1      8    a  one

In [11]:
grouped1 = df['data1'].groupby(df['key1'])
grouped1
grouped2 = df.data1.groupby(df.key1)
grouped2

In [12]:
grouped1.mean()
grouped2.mean()

key1
a    3
b    5
Name: data1, dtype: int32

key1
a    3
b    5
Name: data1, dtype: int32

In [15]:
[df.key1, df.key2]

[0    a
 1    a
 2    b
 3    b
 4    a
 Name: key1, dtype: object, 0    one
 1    two
 2    one
 3    two
 4    one
 Name: key2, dtype: object]

In [13]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     2
      two     5
b     one     7
      two     3
Name: data1, dtype: int32

In [16]:
means.unstack()

key2  one  two
key1
a       2    5
b       7    3

In [17]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005    5
            2006    7
Ohio        2005    3
            2006    1
Name: data1, dtype: int32

In [18]:
df.groupby('key1').mean()

      data1  data2
key1
a         3      5
b         5      4

In [22]:
df.groupby(['key1','key2']).mean()

           data1  data2
key1 key2
a    one     2.0    6.5
     two     5.0    2.0
b    one     7.0    5.0
     two     3.0    3.0

In [20]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

## Iterating over groups

In [23]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
   data1  data2 key1 key2
0      3      5    a  one
1      5      2    a  two
4      1      8    a  one
b
   data1  data2 key1 key2
2      7      5    b  one
3      3      3    b  two

In [25]:
for(k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
   data1  data2 key1 key2
0      3      5    a  one
4      1      8    a  one
('a', 'two')
   data1  data2 key1 key2
1      5      2    a  two
('b', 'one')
   data1  data2 key1 key2
2      7      5    b  one
('b', 'two')
   data1  data2 key1 key2
3      3      3    b  two

In [26]:
pieces = dict(list(df.groupby('key1')))
pieces['b']

   data1  data2 key1 key2
2      7      5    b  one
3      3      3    b  two

In [30]:
df.groupby('key1')
list(df.groupby('key1'))

[('a',    data1  data2 key1 key2
  0      3      5    a  one
  1      5      2    a  two
  4      1      8    a  one), ('b',    data1  data2 key1 key2
  2      7      5    b  one
  3      3      3    b  two)]

In [31]:
df.dtypes
type(df.dtypes)

data1     int32
data2     int32
key1     object
key2     object
dtype: object

pandas.core.series.Series

In [32]:
grouped = df.groupby(df.dtypes, axis=1)
dict(list(grouped))

{dtype('int32'):    data1  data2
 0      3      5
 1      5      2
 2      7      5
 3      3      3
 4      1      8, dtype('O'):   key1 key2
 0    a  one
 1    a  two
 2    b  one
 3    b  two
 4    a  one}

In [33]:
s1 = df.dtypes[[3, 0, 1, 2]]; s1

key2     object
data1     int32
data2     int32
key1     object
dtype: object

## Selecting a column or subset of columns

In [34]:
df.groupby('key1')['data1']
df.groupby('key1')[['data2']]

In [35]:
df['data1'].groupby(df['key1'])
df[['data2']].groupby(df['key1'])

In [36]:
df.groupby(['key1', 'key2'])[['data2']].mean()

           data2
key1 key2
a    one     6.5
     two     2.0
b    one     5.0
     two     3.0

In [37]:
s_grouped = df.groupby(['key1', 'key2'])['data2']
s_grouped

In [39]:
s_grouped.mean()

key1  key2
a     one     6.5
      two     2.0
b     one     5.0
      two     3.0
Name: data2, dtype: float64

## Grouping with dicts and Series

In [59]:
people = DataFrame(np.random.randint(3, size=(5, 5)),
                   columns=['a', 'b', 'c', 'd', 'e'],
                   index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people.loc[2:3, ['b', 'c']] = np.nan # Add a few NA values
people

        a    b    c  d  e
Joe     2  0.0  0.0  0  2
Steve   2  1.0  0.0  0  0
Wes     1  NaN  NaN  1  1
Jim     1  1.0  1.0  2  0
Travis  1  0.0  0.0  2  0

In [58]:
people = DataFrame(np.random.randint(3, size=(5, 5)),
                   columns=['a', 'b', 'c', 'd', 'e'])
people.loc[2:3, ['b', 'c']] = np.nan # Add a few NA values
people

   a    b    c  d  e
0  1  0.0  0.0  2  2
1  2  2.0  1.0  1  2
2  0  NaN  NaN  1  0
3  2  NaN  NaN  2  1
4  0  1.0  2.0  0  2

In [44]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [45]:
by_column = people.groupby(mapping, axis=1)
by_column.sum()

   blue  red
0   3.0  2.0
1   2.0  3.0
2   1.0  1.0
3   2.0  1.0
4   1.0  2.0

In [46]:
list(by_column)

[('blue',      c  d
  0  1.0  2
  1  2.0  0
  2  NaN  1
  3  NaN  2
  4  1.0  0), ('red',    a    b  e
  0  0  2.0  0
  1  0  2.0  1
  2  1  NaN  0
  3  1  NaN  0
  4  0  1.0  1)]

In [47]:
map_series = Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [48]:
people.groupby(map_series, axis=1).count()
people.groupby(map_series, axis=1).sum()

   blue  red
0     2    3
1     2    3
2     1    2
3     1    2
4     2    3

   blue  red
0   3.0  2.0
1   2.0  3.0
2   1.0  1.0
3   2.0  1.0
4   1.0  2.0

## Grouping with functions

In [60]:
people.groupby(len).sum()

   a    b    c  d  e
3  4  1.0  1.0  3  3
5  2  1.0  0.0  0  0
6  1  0.0  0.0  2  0

In [61]:
key_list = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, key_list]).min()

       a    b    c  d  e
3 one  1  0.0  0.0  0  1
  two  1  1.0  1.0  2  0
5 one  2  1.0  0.0  0  0
6 two  1  0.0  0.0  2  0

## Grouping by index levels

In [53]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]], names=['cty', 'tenor'])
hier_df = DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.753887  0.896758 -1.451045  1.960471  0.163870
1      0.388782  0.940880  1.660720  0.642044  0.418988
2     -0.259232 -0.369982 -0.044528  0.112627  0.340088
3      2.000781  0.144897  0.796549 -0.019535 -0.787291

In [54]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

## Data aggregation

In [62]:
df

   data1  data2 key1 key2
0      3      5    a  one
1      5      2    a  two
2      7      5    b  one
3      3      3    b  two
4      1      8    a  one

In [65]:
grouped = df.groupby('key1')
grouped['data1'].quantile(0.9)

key1
a    4.6
b    6.6
Name: data1, dtype: float64

In [67]:
def peak_to_peak(arr):
    return arr.max() - arr.min()
grouped.agg(peak_to_peak)

      data1  data2
key1
a         4      6
b         4      2

In [68]:
grouped.describe()

     data1                                         data2                      \
     count mean       std  min  25%  50%  75%  max count mean       std  min
key1
a      3.0  3.0  2.000000  1.0  2.0  3.0  4.0  5.0   3.0  5.0  3.000000  2.0
b      2.0  5.0  2.828427  3.0  4.0  5.0  6.0  7.0   2.0  4.0  1.414214  3.0


      25%  50%  75%  max
key1
a     3.5  5.0  6.5  8.0
b     3.5  4.0  4.5  5.0

## Column-wise and multiple function application

In [69]:
tips = pd.read_csv('ch08/tips.csv')
# Add tip percentage of total bill
tips['tip_pct'] = tips['tip'] / tips['total_bill']
tips[:6]

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808
5       25.29  4.71    Male     No  Sun  Dinner     4  0.186240

In [73]:
grouped = tips.groupby(['sex', 'smoker'])
grouped.describe()

               size                                                tip  \
              count      mean       std  min  25%  50%  75%  max count
sex    smoker
Female No      54.0  2.592593  1.073146  1.0  2.0  2.0  3.0  6.0  54.0
       Yes     33.0  2.242424  0.613917  1.0  2.0  2.0  2.0  4.0  33.0
Male   No      97.0  2.711340  0.989094  2.0  2.0  2.0  3.0  6.0  97.0
       Yes     60.0  2.500000  0.892530  1.0  2.0  2.0  3.0  5.0  60.0

                         ...     tip_pct           total_bill             \
                   mean  ...         75%       max      count       mean
sex    smoker            ...
Female No      2.773519  ...    0.181630  0.252672       54.0  18.105185
       Yes     2.931515  ...    0.198216  0.416667       33.0  17.977879
Male   No      3.113402  ...    0.186220  0.291990       97.0  19.791237
       Yes     3.051167  ...    0.191697  0.710345       60.0  22.284500


                    std   min      25%    50%      75%    max
sex    smoker
Female No      7.286455  7.25  12.6500  16.69  20.8625  35.83
       Yes     9.189751  3.07  12.7600  16.27  22.1200  44.30
Male   No      8.726566  7.51  13.8100  18.24  22.8200  48.33
       Yes     9.911845  7.25  15.2725  20.39  28.5725  50.81

[4 rows x 32 columns]

In [76]:
for (sex, smoker), group in grouped:
    print(sex, smoker)
    print(group)

Female No
     total_bill   tip     sex smoker   day    time  size   tip_pct
0         16.99  1.01  Female     No   Sun  Dinner     2  0.059447
4         24.59  3.61  Female     No   Sun  Dinner     4  0.146808
11        35.26  5.00  Female     No   Sun  Dinner     4  0.141804
14        14.83  3.02  Female     No   Sun  Dinner     2  0.203641
16        10.33  1.67  Female     No   Sun  Dinner     3  0.161665
18        16.97  3.50  Female     No   Sun  Dinner     3  0.206246
21        20.29  2.75  Female     No   Sat  Dinner     2  0.135535
22        15.77  2.23  Female     No   Sat  Dinner     2  0.141408
29        19.65  3.00  Female     No   Sat  Dinner     2  0.152672
32        15.06  3.00  Female     No   Sat  Dinner     2  0.199203
33        20.69  2.45  Female     No   Sat  Dinner     4  0.118415
37        16.93  3.07  Female     No   Sat  Dinner     3  0.181335
51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
52        34.81  5.20  Female     No   Sun  Dinner     4  0.149382
57        26.41  1.50  Female     No   Sat  Dinner     2  0.056797
66        16.45  2.47  Female     No   Sat  Dinner     2  0.150152
71        17.07  3.00  Female     No   Sat  Dinner     3  0.175747
74        14.73  2.20  Female     No   Sat  Dinner     2  0.149355
82        10.07  1.83  Female     No  Thur   Lunch     1  0.181728
85        34.83  5.17  Female     No  Thur   Lunch     4  0.148435
94        22.75  3.25  Female     No   Fri  Dinner     2  0.142857
104       20.92  4.08  Female     No   Sat  Dinner     2  0.195029
111        7.25  1.00  Female     No   Sat  Dinner     1  0.137931
114       25.71  4.00  Female     No   Sun  Dinner     3  0.155581
115       17.31  3.50  Female     No   Sun  Dinner     2  0.202195
117       10.65  1.50  Female     No  Thur   Lunch     2  0.140845
118       12.43  1.80  Female     No  Thur   Lunch     2  0.144811
119       24.08  2.92  Female     No  Thur   Lunch     4  0.121262
121       13.42  1.68  Female     No  Thur   Lunch     2  0.125186
124       12.48  2.52  Female     No  Thur   Lunch     2  0.201923
125       29.80  4.20  Female     No  Thur   Lunch     6  0.140940
127       14.52  2.00  Female     No  Thur   Lunch     2  0.137741
128       11.38  2.00  Female     No  Thur   Lunch     2  0.175747
131       20.27  2.83  Female     No  Thur   Lunch     2  0.139615
132       11.17  1.50  Female     No  Thur   Lunch     2  0.134288
133       12.26  2.00  Female     No  Thur   Lunch     2  0.163132
134       18.26  3.25  Female     No  Thur   Lunch     2  0.177985
135        8.51  1.25  Female     No  Thur   Lunch     2  0.146886
136       10.33  2.00  Female     No  Thur   Lunch     2  0.193611
137       14.15  2.00  Female     No  Thur   Lunch     2  0.141343
139       13.16  2.75  Female     No  Thur   Lunch     2  0.208967
140       17.47  3.50  Female     No  Thur   Lunch     2  0.200343
143       27.05  5.00  Female     No  Thur   Lunch     6  0.184843
144       16.43  2.30  Female     No  Thur   Lunch     2  0.139988
145        8.35  1.50  Female     No  Thur   Lunch     2  0.179641
146       18.64  1.36  Female     No  Thur   Lunch     3  0.072961
147       11.87  1.63  Female     No  Thur   Lunch     2  0.137321
155       29.85  5.14  Female     No   Sun  Dinner     5  0.172194
157       25.00  3.75  Female     No   Sun  Dinner     4  0.150000
158       13.39  2.61  Female     No   Sun  Dinner     2  0.194922
162       16.21  2.00  Female     No   Sun  Dinner     3  0.123381
223       15.98  3.00  Female     No   Fri   Lunch     3  0.187735
238       35.83  4.67  Female     No   Sat  Dinner     3  0.130338
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744
Female Yes
     total_bill   tip     sex smoker   day    time  size   tip_pct
67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
72        26.86  3.14  Female    Yes   Sat  Dinner     2  0.116902
73        25.28  5.00  Female    Yes   Sat  Dinner     2  0.197785
92         5.75  1.00  Female    Yes   Fri  Dinner     2  0.173913
93        16.32  4.30  Female    Yes   Fri  Dinner     2  0.263480
100       11.35  2.50  Female    Yes   Fri  Dinner     2  0.220264
101       15.38  3.00  Female    Yes   Fri  Dinner     2  0.195059
102       44.30  2.50  Female    Yes   Sat  Dinner     3  0.056433
103       22.42  3.48  Female    Yes   Sat  Dinner     2  0.155219
109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
164       17.51  3.00  Female    Yes   Sun  Dinner     2  0.171331
168       10.59  1.61  Female    Yes   Sat  Dinner     2  0.152030
169       10.63  2.00  Female    Yes   Sat  Dinner     2  0.188147
178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
186       20.90  3.50  Female    Yes   Sun  Dinner     3  0.167464
188       18.15  3.50  Female    Yes   Sun  Dinner     3  0.192837
191       19.81  4.19  Female    Yes  Thur   Lunch     2  0.211509
197       43.11  5.00  Female    Yes  Thur   Lunch     4  0.115982
198       13.00  2.00  Female    Yes  Thur   Lunch     2  0.153846
201       12.74  2.01  Female    Yes  Thur   Lunch     2  0.157771
202       13.00  2.00  Female    Yes  Thur   Lunch     2  0.153846
203       16.40  2.50  Female    Yes  Thur   Lunch     2  0.152439
205       16.47  3.23  Female    Yes  Thur   Lunch     3  0.196114
209       12.76  2.23  Female    Yes   Sat  Dinner     2  0.174765
213       13.27  2.50  Female    Yes   Sat  Dinner     2  0.188395
214       28.17  6.50  Female    Yes   Sat  Dinner     3  0.230742
215       12.90  1.10  Female    Yes   Sat  Dinner     2  0.085271
219       30.14  3.09  Female    Yes   Sat  Dinner     4  0.102522
221       13.42  3.48  Female    Yes   Fri   Lunch     2  0.259314
225       16.27  2.50  Female    Yes   Fri   Lunch     2  0.153657
226       10.09  2.00  Female    Yes   Fri   Lunch     2  0.198216
229       22.12  2.88  Female    Yes   Sat  Dinner     2  0.130199
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
Male No
     total_bill   tip   sex smoker   day    time  size   tip_pct
1         10.34  1.66  Male     No   Sun  Dinner     3  0.160542
2         21.01  3.50  Male     No   Sun  Dinner     3  0.166587
3         23.68  3.31  Male     No   Sun  Dinner     2  0.139780
5         25.29  4.71  Male     No   Sun  Dinner     4  0.186240
6          8.77  2.00  Male     No   Sun  Dinner     2  0.228050
7         26.88  3.12  Male     No   Sun  Dinner     4  0.116071
8         15.04  1.96  Male     No   Sun  Dinner     2  0.130319
9         14.78  3.23  Male     No   Sun  Dinner     2  0.218539
10        10.27  1.71  Male     No   Sun  Dinner     2  0.166504
12        15.42  1.57  Male     No   Sun  Dinner     2  0.101816
13        18.43  3.00  Male     No   Sun  Dinner     4  0.162778
15        21.58  3.92  Male     No   Sun  Dinner     2  0.181650
17        16.29  3.71  Male     No   Sun  Dinner     3  0.227747
19        20.65  3.35  Male     No   Sat  Dinner     3  0.162228
20        17.92  4.08  Male     No   Sat  Dinner     2  0.227679
23        39.42  7.58  Male     No   Sat  Dinner     4  0.192288
24        19.82  3.18  Male     No   Sat  Dinner     2  0.160444
25        17.81  2.34  Male     No   Sat  Dinner     4  0.131387
26        13.37  2.00  Male     No   Sat  Dinner     2  0.149589
27        12.69  2.00  Male     No   Sat  Dinner     2  0.157604
28        21.70  4.30  Male     No   Sat  Dinner     2  0.198157
30         9.55  1.45  Male     No   Sat  Dinner     2  0.151832
31        18.35  2.50  Male     No   Sat  Dinner     4  0.136240
34        17.78  3.27  Male     No   Sat  Dinner     2  0.183915
35        24.06  3.60  Male     No   Sat  Dinner     3  0.149626
36        16.31  2.00  Male     No   Sat  Dinner     3  0.122624
38        18.69  2.31  Male     No   Sat  Dinner     3  0.123596
39        31.27  5.00  Male     No   Sat  Dinner     3  0.159898
40        16.04  2.24  Male     No   Sat  Dinner     3  0.139651
41        17.46  2.54  Male     No   Sun  Dinner     2  0.145475
..          ...   ...   ...    ...   ...     ...   ...       ...
126        8.52  1.48  Male     No  Thur   Lunch     2  0.173709
129       22.82  2.18  Male     No  Thur   Lunch     3  0.095530
130       19.08  1.50  Male     No  Thur   Lunch     2  0.078616
141       34.30  6.70  Male     No  Thur   Lunch     6  0.195335
142       41.19  5.00  Male     No  Thur   Lunch     5  0.121389
148        9.78  1.73  Male     No  Thur   Lunch     2  0.176892
149        7.51  2.00  Male     No  Thur   Lunch     2  0.266312
150       14.07  2.50  Male     No   Sun  Dinner     2  0.177683
151       13.13  2.00  Male     No   Sun  Dinner     2  0.152323
152       17.26  2.74  Male     No   Sun  Dinner     3  0.158749
153       24.55  2.00  Male     No   Sun  Dinner     4  0.081466
154       19.77  2.00  Male     No   Sun  Dinner     4  0.101163
156       48.17  5.00  Male     No   Sun  Dinner     6  0.103799
159       16.49  2.00  Male     No   Sun  Dinner     4  0.121286
160       21.50  3.50  Male     No   Sun  Dinner     4  0.162791
161       12.66  2.50  Male     No   Sun  Dinner     2  0.197472
163       13.81  2.00  Male     No   Sun  Dinner     2  0.144823
165       24.52  3.48  Male     No   Sun  Dinner     3  0.141925
166       20.76  2.24  Male     No   Sun  Dinner     2  0.107900
167       31.71  4.50  Male     No   Sun  Dinner     4  0.141911
185       20.69  5.00  Male     No   Sun  Dinner     5  0.241663
195        7.56  1.44  Male     No  Thur   Lunch     2  0.190476
212       48.33  9.00  Male     No   Sat  Dinner     4  0.186220
227       20.45  3.00  Male     No   Sat  Dinner     4  0.146699
228       13.28  2.72  Male     No   Sat  Dinner     2  0.204819
232       11.61  3.39  Male     No   Sat  Dinner     2  0.291990
233       10.77  1.47  Male     No   Sat  Dinner     2  0.136490
235       10.07  1.25  Male     No   Sat  Dinner     2  0.124131
239       29.03  5.92  Male     No   Sat  Dinner     3  0.203927
242       17.82  1.75  Male     No   Sat  Dinner     2  0.098204

[97 rows x 8 columns]
Male Yes
     total_bill    tip   sex smoker   day    time  size   tip_pct
56        38.01   3.00  Male    Yes   Sat  Dinner     4  0.078927
58        11.24   1.76  Male    Yes   Sat  Dinner     2  0.156584
60        20.29   3.21  Male    Yes   Sat  Dinner     2  0.158206
61        13.81   2.00  Male    Yes   Sat  Dinner     2  0.144823
62        11.02   1.98  Male    Yes   Sat  Dinner     2  0.179673
63        18.29   3.76  Male    Yes   Sat  Dinner     4  0.205577
69        15.01   2.09  Male    Yes   Sat  Dinner     2  0.139241
76        17.92   3.08  Male    Yes   Sat  Dinner     2  0.171875
80        19.44   3.00  Male    Yes  Thur   Lunch     2  0.154321
83        32.68   5.00  Male    Yes  Thur   Lunch     2  0.152999
90        28.97   3.00  Male    Yes   Fri  Dinner     2  0.103555
95        40.17   4.73  Male    Yes   Fri  Dinner     4  0.117750
96        27.28   4.00  Male    Yes   Fri  Dinner     2  0.146628
97        12.03   1.50  Male    Yes   Fri  Dinner     2  0.124688
98        21.01   3.00  Male    Yes   Fri  Dinner     2  0.142789
105       15.36   1.64  Male    Yes   Sat  Dinner     2  0.106771
106       20.49   4.06  Male    Yes   Sat  Dinner     2  0.198145
107       25.21   4.29  Male    Yes   Sat  Dinner     2  0.170171
138       16.00   2.00  Male    Yes  Thur   Lunch     2  0.125000
170       50.81  10.00  Male    Yes   Sat  Dinner     3  0.196812
171       15.81   3.16  Male    Yes   Sat  Dinner     2  0.199873
172        7.25   5.15  Male    Yes   Sun  Dinner     2  0.710345
173       31.85   3.18  Male    Yes   Sun  Dinner     2  0.099843
174       16.82   4.00  Male    Yes   Sun  Dinner     2  0.237812
175       32.90   3.11  Male    Yes   Sun  Dinner     2  0.094529
176       17.89   2.00  Male    Yes   Sun  Dinner     2  0.111794
177       14.48   2.00  Male    Yes   Sun  Dinner     2  0.138122
179       34.63   3.55  Male    Yes   Sun  Dinner     2  0.102512
180       34.65   3.68  Male    Yes   Sun  Dinner     4  0.106205
181       23.33   5.65  Male    Yes   Sun  Dinner     2  0.242177
182       45.35   3.50  Male    Yes   Sun  Dinner     3  0.077178
183       23.17   6.50  Male    Yes   Sun  Dinner     4  0.280535
184       40.55   3.00  Male    Yes   Sun  Dinner     2  0.073983
187       30.46   2.00  Male    Yes   Sun  Dinner     5  0.065660
189       23.10   4.00  Male    Yes   Sun  Dinner     3  0.173160
190       15.69   1.50  Male    Yes   Sun  Dinner     2  0.095602
192       28.44   2.56  Male    Yes  Thur   Lunch     2  0.090014
193       15.48   2.02  Male    Yes  Thur   Lunch     2  0.130491
194       16.58   4.00  Male    Yes  Thur   Lunch     2  0.241255
196       10.34   2.00  Male    Yes  Thur   Lunch     2  0.193424
199       13.51   2.00  Male    Yes  Thur   Lunch     2  0.148038
200       18.71   4.00  Male    Yes  Thur   Lunch     3  0.213789
204       20.53   4.00  Male    Yes  Thur   Lunch     4  0.194837
206       26.59   3.41  Male    Yes   Sat  Dinner     3  0.128244
207       38.73   3.00  Male    Yes   Sat  Dinner     4  0.077459
208       24.27   2.03  Male    Yes   Sat  Dinner     2  0.083642
210       30.06   2.00  Male    Yes   Sat  Dinner     3  0.066534
211       25.89   5.16  Male    Yes   Sat  Dinner     4  0.199305
216       28.15   3.00  Male    Yes   Sat  Dinner     5  0.106572
217       11.59   1.50  Male    Yes   Sat  Dinner     2  0.129422
218        7.74   1.44  Male    Yes   Sat  Dinner     2  0.186047
220       12.16   2.20  Male    Yes   Fri   Lunch     2  0.180921
222        8.58   1.92  Male    Yes   Fri   Lunch     1  0.223776
224       13.42   1.58  Male    Yes   Fri   Lunch     2  0.117735
230       24.01   2.00  Male    Yes   Sat  Dinner     4  0.083299
231       15.69   3.00  Male    Yes   Sat  Dinner     3  0.191205
234       15.53   3.00  Male    Yes   Sat  Dinner     2  0.193175
236       12.60   1.00  Male    Yes   Sat  Dinner     2  0.079365
237       32.83   1.17  Male    Yes   Sat  Dinner     2  0.035638
241       22.67   2.00  Male    Yes   Sat  Dinner     2  0.088222

In [77]:
grouped_pct = grouped['tip_pct']
grouped['tip_pct'].mean()
grouped_pct.agg('mean')

sex     smoker
Female  No        0.156921
        Yes       0.182150
Male    No        0.160669
        Yes       0.152771
Name: tip_pct, dtype: float64

sex     smoker
Female  No        0.156921
        Yes       0.182150
Male    No        0.160669
        Yes       0.152771
Name: tip_pct, dtype: float64

In [78]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                   mean       std  peak_to_peak
sex    smoker
Female No      0.156921  0.036421      0.195876
       Yes     0.182150  0.071595      0.360233
Male   No      0.160669  0.041849      0.220186
       Yes     0.152771  0.090588      0.674707

In [79]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                    foo       bar
sex    smoker
Female No      0.156921  0.036421
       Yes     0.182150  0.071595
Male   No      0.160669  0.041849
       Yes     0.152771  0.090588

In [80]:
functions = ['count', 'mean', 'max']
result = grouped['tip_pct', 'total_bill'].agg(functions)
result

              tip_pct                     total_bill
                count      mean       max      count       mean    max
sex    smoker
Female No          54  0.156921  0.252672         54  18.105185  35.83
       Yes         33  0.182150  0.416667         33  17.977879  44.30
Male   No          97  0.160669  0.291990         97  19.791237  48.33
       Yes         60  0.152771  0.710345         60  22.284500  50.81

In [81]:
result['tip_pct']

               count      mean       max
sex    smoker
Female No         54  0.156921  0.252672
       Yes        33  0.182150  0.416667
Male   No         97  0.160669  0.291990
       Yes        60  0.152771  0.710345

In [82]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]
grouped['tip_pct', 'total_bill'].agg(ftuples)

                   tip_pct              total_bill
              Durchschnitt Abweichung Durchschnitt Abweichung
sex    smoker
Female No         0.156921   0.001327    18.105185  53.092422
       Yes        0.182150   0.005126    17.977879  84.451517
Male   No         0.160669   0.001751    19.791237  76.152961
       Yes        0.152771   0.008206    22.284500  98.244673

In [83]:
grouped.agg({'tip' : np.max, 'size' : 'sum'})

                tip  size
sex    smoker
Female No       5.2   140
       Yes      6.5    74
Male   No       9.0   263
       Yes     10.0   150

In [84]:
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'],
             'size' : 'sum'})

                tip_pct                               size
                    min       max      mean       std  sum
sex    smoker
Female No      0.056797  0.252672  0.156921  0.036421  140
       Yes     0.056433  0.416667  0.182150  0.071595   74
Male   No      0.071804  0.291990  0.160669  0.041849  263
       Yes     0.035638  0.710345  0.152771  0.090588  150

## Group-wise operations and transformations

In [85]:
df

   data1  data2 key1 key2
0      3      5    a  one
1      5      2    a  two
2      7      5    b  one
3      3      3    b  two
4      1      8    a  one

In [86]:
k1_means = df.groupby('key1').mean().add_prefix('mean_')
k1_means

      mean_data1  mean_data2
key1
a              3           5
b              5           4

In [87]:
pd.merge(df, k1_means, left_on='key1', right_index=True)

   data1  data2 key1 key2  mean_data1  mean_data2
0      3      5    a  one           3           5
1      5      2    a  two           3           5
4      1      8    a  one           3           5
2      7      5    b  one           5           4
3      3      3    b  two           5           4

In [88]:
people

        a    b    c  d  e
Joe     2  0.0  0.0  0  2
Steve   2  1.0  0.0  0  0
Wes     1  NaN  NaN  1  1
Jim     1  1.0  1.0  2  0
Travis  1  0.0  0.0  2  0

In [89]:
key = ['one', 'two', 'one', 'two', 'one']
people.groupby(key).mean()

            a    b    c    d    e
one  1.333333  0.0  0.0  1.0  1.0
two  1.500000  1.0  0.5  1.0  0.0

In [90]:
people.groupby(key).transform(np.mean)

               a    b    c  d  e
Joe     1.333333  0.0  0.0  1  1
Steve   1.500000  1.0  0.5  1  0
Wes     1.333333  0.0  0.0  1  1
Jim     1.500000  1.0  0.5  1  0
Travis  1.333333  0.0  0.0  1  1

In [94]:
def demean(arr):
    return arr - arr.mean()
demeaned = people.groupby(key).transform(demean)
demeaned

               a    b    c    d    e
Joe     0.666667  0.0  0.0 -1.0  1.0
Steve   0.500000  0.0 -0.5 -1.0  0.0
Wes    -0.333333  NaN  NaN  0.0  0.0
Jim    -0.500000  0.0  0.5  1.0  0.0
Travis -0.333333  0.0  0.0  1.0 -1.0

In [95]:
demeaned.groupby(key).mean()

                a    b    c    d    e
one  7.401487e-17  0.0  0.0  0.0  0.0
two  0.000000e+00  0.0  0.0  0.0  0.0

## Apply: General split-apply-combine

In [96]:
tips[:10]
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]
top(tips, n=6)

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808
5       25.29  4.71    Male     No  Sun  Dinner     4  0.186240
6        8.77  2.00    Male     No  Sun  Dinner     2  0.228050
7       26.88  3.12    Male     No  Sun  Dinner     4  0.116071
8       15.04  1.96    Male     No  Sun  Dinner     2  0.130319
9       14.78  3.23    Male     No  Sun  Dinner     2  0.218539

     total_bill   tip     sex smoker  day    time  size   tip_pct
109       14.31  4.00  Female    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39    Male     No  Sat  Dinner     2  0.291990
67         3.07  1.00  Female    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes  Sun  Dinner     2  0.710345

In [97]:
tips.groupby('smoker').apply(top)

            total_bill   tip     sex smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
       185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
       51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
       149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
       232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [98]:
tips.groupby(['smoker', 'day']).apply(top, n=2, column='total_bill')
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill    tip     sex smoker   day    time  size  \
smoker day
No     Fri  91        22.49   3.50    Male     No   Fri  Dinner     2
            94        22.75   3.25  Female     No   Fri  Dinner     2
       Sat  59        48.27   6.73    Male     No   Sat  Dinner     4
            212       48.33   9.00    Male     No   Sat  Dinner     4
       Sun  112       38.07   4.00    Male     No   Sun  Dinner     3
            156       48.17   5.00    Male     No   Sun  Dinner     6
       Thur 85        34.83   5.17  Female     No  Thur   Lunch     4
            142       41.19   5.00    Male     No  Thur   Lunch     5
Yes    Fri  90        28.97   3.00    Male    Yes   Fri  Dinner     2
            95        40.17   4.73    Male    Yes   Fri  Dinner     4
       Sat  102       44.30   2.50  Female    Yes   Sat  Dinner     3
            170       50.81  10.00    Male    Yes   Sat  Dinner     3
       Sun  184       40.55   3.00    Male    Yes   Sun  Dinner     2
            182       45.35   3.50    Male    Yes   Sun  Dinner     3
       Thur 83        32.68   5.00    Male    Yes  Thur   Lunch     2
            197       43.11   5.00  Female    Yes  Thur   Lunch     4

                  tip_pct
smoker day
No     Fri  91   0.155625
            94   0.142857
       Sat  59   0.139424
            212  0.186220
       Sun  112  0.105070
            156  0.103799
       Thur 85   0.148435
            142  0.121389
Yes    Fri  90   0.103555
            95   0.117750
       Sat  102  0.056433
            170  0.196812
       Sun  184  0.073983
            182  0.077178
       Thur 83   0.152999
            197  0.115982

                 total_bill    tip     sex smoker   day    time  size  \
smoker day
No     Fri  94        22.75   3.25  Female     No   Fri  Dinner     2
       Sat  212       48.33   9.00    Male     No   Sat  Dinner     4
       Sun  156       48.17   5.00    Male     No   Sun  Dinner     6
       Thur 142       41.19   5.00    Male     No  Thur   Lunch     5
Yes    Fri  95        40.17   4.73    Male    Yes   Fri  Dinner     4
       Sat  170       50.81  10.00    Male    Yes   Sat  Dinner     3
       Sun  182       45.35   3.50    Male    Yes   Sun  Dinner     3
       Thur 197       43.11   5.00  Female    Yes  Thur   Lunch     4

                  tip_pct
smoker day
No     Fri  94   0.142857
       Sat  212  0.186220
       Sun  156  0.103799
       Thur 142  0.121389
Yes    Fri  95   0.117750
       Sat  170  0.196812
       Sun  182  0.077178
       Thur 197  0.115982

In [99]:
tips.groupby(['smoker', 'day']).apply(top, n=2, column='total_bill')
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill    tip     sex smoker   day    time  size  \
smoker day
No     Fri  91        22.49   3.50    Male     No   Fri  Dinner     2
            94        22.75   3.25  Female     No   Fri  Dinner     2
       Sat  59        48.27   6.73    Male     No   Sat  Dinner     4
            212       48.33   9.00    Male     No   Sat  Dinner     4
       Sun  112       38.07   4.00    Male     No   Sun  Dinner     3
            156       48.17   5.00    Male     No   Sun  Dinner     6
       Thur 85        34.83   5.17  Female     No  Thur   Lunch     4
            142       41.19   5.00    Male     No  Thur   Lunch     5
Yes    Fri  90        28.97   3.00    Male    Yes   Fri  Dinner     2
            95        40.17   4.73    Male    Yes   Fri  Dinner     4
       Sat  102       44.30   2.50  Female    Yes   Sat  Dinner     3
            170       50.81  10.00    Male    Yes   Sat  Dinner     3
       Sun  184       40.55   3.00    Male    Yes   Sun  Dinner     2
            182       45.35   3.50    Male    Yes   Sun  Dinner     3
       Thur 83        32.68   5.00    Male    Yes  Thur   Lunch     2
            197       43.11   5.00  Female    Yes  Thur   Lunch     4

                  tip_pct
smoker day
No     Fri  91   0.155625
            94   0.142857
       Sat  59   0.139424
            212  0.186220
       Sun  112  0.105070
            156  0.103799
       Thur 85   0.148435
            142  0.121389
Yes    Fri  90   0.103555
            95   0.117750
       Sat  102  0.056433
            170  0.196812
       Sun  184  0.073983
            182  0.077178
       Thur 83   0.152999
            197  0.115982

                 total_bill    tip     sex smoker   day    time  size  \
smoker day
No     Fri  94        22.75   3.25  Female     No   Fri  Dinner     2
       Sat  212       48.33   9.00    Male     No   Sat  Dinner     4
       Sun  156       48.17   5.00    Male     No   Sun  Dinner     6
       Thur 142       41.19   5.00    Male     No  Thur   Lunch     5
Yes    Fri  95        40.17   4.73    Male    Yes   Fri  Dinner     4
       Sat  170       50.81  10.00    Male    Yes   Sat  Dinner     3
       Sun  182       45.35   3.50    Male    Yes   Sun  Dinner     3
       Thur 197       43.11   5.00  Female    Yes  Thur   Lunch     4

                  tip_pct
smoker day
No     Fri  94   0.142857
       Sat  212  0.186220
       Sun  156  0.103799
       Thur 142  0.121389
Yes    Fri  95   0.117750
       Sat  170  0.196812
       Sun  182  0.077178
       Thur 197  0.115982

In [100]:
result = tips.groupby('smoker')['tip_pct'].describe()
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [101]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [102]:
f = lambda x: x.describe()
grouped.apply(f)

                          size        tip    tip_pct  total_bill
sex    smoker
Female No     count  54.000000  54.000000  54.000000   54.000000
              mean    2.592593   2.773519   0.156921   18.105185
              std     1.073146   1.128425   0.036421    7.286455
              min     1.000000   1.000000   0.056797    7.250000
              25%     2.000000   2.000000   0.139708   12.650000
              50%     2.000000   2.680000   0.149691   16.690000
              75%     3.000000   3.437500   0.181630   20.862500
              max     6.000000   5.200000   0.252672   35.830000
       Yes    count  33.000000  33.000000  33.000000   33.000000
              mean    2.242424   2.931515   0.182150   17.977879
              std     0.613917   1.219916   0.071595    9.189751
              min     1.000000   1.000000   0.056433    3.070000
              25%     2.000000   2.000000   0.152439   12.760000
              50%     2.000000   2.880000   0.173913   16.270000
              75%     2.000000   3.500000   0.198216   22.120000
              max     4.000000   6.500000   0.416667   44.300000
Male   No     count  97.000000  97.000000  97.000000   97.000000
              mean    2.711340   3.113402   0.160669   19.791237
              std     0.989094   1.489559   0.041849    8.726566
              min     2.000000   1.250000   0.071804    7.510000
              25%     2.000000   2.000000   0.131810   13.810000
              50%     2.000000   2.740000   0.157604   18.240000
              75%     3.000000   3.710000   0.186220   22.820000
              max     6.000000   9.000000   0.291990   48.330000
       Yes    count  60.000000  60.000000  60.000000   60.000000
              mean    2.500000   3.051167   0.152771   22.284500
              std     0.892530   1.500120   0.090588    9.911845
              min     1.000000   1.000000   0.035638    7.250000
              25%     2.000000   2.000000   0.101845   15.272500
              50%     2.000000   3.000000   0.141015   20.390000
              75%     3.000000   3.820000   0.191697   28.572500
              max     5.000000  10.000000   0.710345   50.810000

## Quantile and bucket anlysis

In [103]:
frame = DataFrame({'data1': np.random.randn(1000),
                   'data2': np.random.randn(1000)})
factor = pd.cut(frame.data1, 4)
factor[:10]
type(factor)

0    (-1.79, 0.0912]
1    (-1.79, 0.0912]
2     (1.972, 3.853]
3    (-1.79, 0.0912]
4    (-1.79, 0.0912]
5    (0.0912, 1.972]
6    (-1.79, 0.0912]
7    (0.0912, 1.972]
8    (0.0912, 1.972]
9    (-1.79, 0.0912]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.679, -1.79] < (-1.79, 0.0912] < (0.0912, 1.972] < (1.972, 3.853]]

pandas.core.series.Series

In [104]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
            'count': group.count(), 'mean': group.mean()}

grouped = frame.data2.groupby(factor)
grouped.apply(get_stats).unstack()

                 count       max      mean       min
data1
(-3.679, -1.79]   24.0  1.847269  0.044236 -1.797166
(-1.79, 0.0912]  500.0  2.670508  0.005172 -2.431757
(0.0912, 1.972]  458.0  3.378134 -0.001718 -3.141375
(1.972, 3.853]    18.0  1.315193 -0.292747 -3.110265

In [105]:
grouped.groups

{Interval(-3.6789999999999998, -1.79, closed='right'): Int64Index([ 30,  82, 113, 181, 194, 239, 242, 246, 251, 256, 281, 356, 515,
             522, 523, 537, 563, 584, 595, 623, 628, 912, 933, 969],
            dtype='int64'),
 Interval(-1.79, 0.091200000000000003, closed='right'): Int64Index([  0,   1,   3,   4,   6,   9,  16,  17,  18,  19,
             ...
             972, 974, 977, 978, 987, 988, 991, 996, 997, 999],
            dtype='int64', length=500),
 Interval(0.091200000000000003, 1.972, closed='right'): Int64Index([  5,   7,   8,  10,  11,  12,  13,  14,  15,  20,
             ...
             984, 985, 986, 989, 990, 992, 993, 994, 995, 998],
            dtype='int64', length=458),
 Interval(1.972, 3.8530000000000002, closed='right'): Int64Index([  2,  39,  42, 111, 114, 160, 203, 349, 367, 383, 426, 486, 540,
             673, 689, 838, 855, 890],
            dtype='int64')}

In [108]:
grouping = pd.qcut(frame.data1, 10, labels=False)
grouping

0      4
1      2
2      9
3      4
4      4
5      9
6      0
7      8
8      6
9      3
10     9
11     5
12     5
13     6
14     7
15     7
16     3
17     4
18     3
19     3
20     9
21     3
22     6
23     2
24     2
25     0
26     3
27     8
28     5
29     1
      ..
970    4
971    4
972    0
973    6
974    4
975    5
976    8
977    3
978    3
979    8
980    6
981    5
982    9
983    6
984    8
985    8
986    6
987    4
988    0
989    9
990    9
991    4
992    5
993    5
994    8
995    6
996    5
997    5
998    8
999    3
Name: data1, Length: 1000, dtype: int64

In [107]:
grouped = frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

       count       max      mean       min
data1
0      100.0  1.847269  0.160912 -2.181473
1      100.0  2.643396 -0.015563 -2.416970
2      100.0  2.126706 -0.217605 -2.381475
3      100.0  2.670508  0.080824 -2.295885
4      100.0  2.167097  0.064516 -1.873239
5      100.0  2.060531 -0.108497 -3.141375
6      100.0  2.259351 -0.002337 -2.400782
7      100.0  2.138909 -0.101994 -2.572466
8      100.0  2.556462  0.013797 -2.563130
9      100.0  3.378134  0.101863 -3.110265

## Example: Filling missing values with group-specific values

In [114]:
s = Series(np.random.randn(6))
s[::2] = np.nan
s

0         NaN
1   -0.346796
2         NaN
3   -0.245498
4         NaN
5   -0.394881
dtype: float64

In [115]:
s.fillna(s.mean())

0   -0.329058
1   -0.346796
2   -0.329058
3   -0.245498
4   -0.329058
5   -0.394881
dtype: float64

In [116]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']
group_key = ['East'] * 4 + ['West'] * 4
data = Series(np.random.randn(8), index=states)
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data

Ohio          1.420337
New York      0.818480
Vermont            NaN
Florida      -2.102777
Oregon        0.220618
Nevada             NaN
California   -1.300116
Idaho              NaN
dtype: float64

In [117]:
data.groupby(group_key).mean()

East    0.045347
West   -0.539749
dtype: float64

In [118]:
fill_mean = lambda g: g.fillna(g.mean())
data.groupby(group_key).apply(fill_mean)

Ohio          1.420337
New York      0.818480
Vermont       0.045347
Florida      -2.102777
Oregon        0.220618
Nevada       -0.539749
California   -1.300116
Idaho        -0.539749
dtype: float64

In [119]:
fill_values = {'East': 0.5, 'West': -1}
fill_func = lambda g: g.fillna(fill_values[g.name])

data.groupby(group_key).apply(fill_func)

Ohio          1.420337
New York      0.818480
Vermont       0.500000
Florida      -2.102777
Oregon        0.220618
Nevada       -1.000000
California   -1.300116
Idaho        -1.000000
dtype: float64

## Example: Random sampling and permutation

In [121]:
# Hearts, Spades, Clubs, Diamonds
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)

deck = Series(card_val, index=cards)

In [122]:
deck[:13]

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
dtype: int64

In [123]:
def draw(deck, n=5):
    return deck.take(np.random.permutation(len(deck))[:n])
draw(deck)

10S    10
4H      4
QC     10
AD      1
5D      5
dtype: int64

In [124]:
get_suit = lambda card: card[-1] # last letter is suit
deck.groupby(get_suit).apply(draw, n=2)

C  7C     7
   8C     8
D  9D     9
   3D     3
H  5H     5
   2H     2
S  8S     8
   JS    10
dtype: int64

## 실습

#### 1.XE오라클 서버에 접속하여 emp, dept 테이블의 데이터를 pandas 데이터프레임으로 출력

In [125]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

from sqlalchemy import create_engine
import cx_Oracle

In [128]:
engine = create_engine('oracle://dream20:catcher@70.12.50.50:1521/XE')

In [132]:
with engine.connect() as conn, conn.begin():
    emp = pd.read_sql_table('emp',conn)
    dept = pd.read_sql_table('dept',conn)

In [133]:
emp

    empno   ename        job     mgr   hiredate   sal    comm  deptno
0    7369   SMITH      CLERK  7902.0 1980-12-17   800     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850     NaN      30
6    7782   CLARK    MANAGER  7839.0 1981-06-09  2450     NaN      10
7    7788   SCOTT    ANALYST  7566.0 1982-12-09  3000     NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000     NaN      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500     0.0      30
10   7876   ADAMS      CLERK  7788.0 1983-01-12  1100     NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950     NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000     NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300     NaN      10

In [134]:
dept

   deptno       dname       loc
0      10  ACCOUNTING  NEW YORK
1      20    RESEARCH    DALLAS
2      30       SALES   CHICAGO
3      40  OPERATIONS    BOSTON

#### 2. 사원 이름, 급여, 연봉을 출력하세요.

In [147]:
emp_sal = emp.sal*12
emp_sal.name = 'ann_sal'
emp[['ename', 'sal']].join(emp_sal)

     ename   sal  ann_sal
0    SMITH   800     9600
1    ALLEN  1600    19200
2     WARD  1250    15000
3    JONES  2975    35700
4   MARTIN  1250    15000
5    BLAKE  2850    34200
6    CLARK  2450    29400
7    SCOTT  3000    36000
8     KING  5000    60000
9   TURNER  1500    18000
10   ADAMS  1100    13200
11   JAMES   950    11400
12    FORD  3000    36000
13  MILLER  1300    15600

#### 3. 연봉 산정 방식이 커미션을 고려하는 것으로 바꼈습니다. 2번을 다시 수행하세요
#### 연봉 = 기존연봉 * (1 + 커미션)
#### 커미션이 없는 직원은 커미션 0으로 간주하세요

In [149]:
comm = emp.comm.fillna(0)
comm

0        0.0
1      300.0
2      500.0
3        0.0
4     1400.0
5        0.0
6        0.0
7        0.0
8        0.0
9        0.0
10       0.0
11       0.0
12       0.0
13       0.0
Name: comm, dtype: float64

In [151]:
emp_sal = emp.sal*12
emp_sal

0      9600
1     19200
2     15000
3     35700
4     15000
5     34200
6     29400
7     36000
8     60000
9     18000
10    13200
11    11400
12    36000
13    15600
Name: sal, dtype: int64

In [160]:
ann_sal = emp_sal*(1+comm/100)
ann_sal.name = 'ann_sal'

In [161]:
emp[['ename', 'sal']].join(ann_sal)

     ename   sal   ann_sal
0    SMITH   800    9600.0
1    ALLEN  1600   76800.0
2     WARD  1250   90000.0
3    JONES  2975   35700.0
4   MARTIN  1250  225000.0
5    BLAKE  2850   34200.0
6    CLARK  2450   29400.0
7    SCOTT  3000   36000.0
8     KING  5000   60000.0
9   TURNER  1500   18000.0
10   ADAMS  1100   13200.0
11   JAMES   950   11400.0
12    FORD  3000   36000.0
13  MILLER  1300   15600.0

#### 4. 다음의 사원정보를 나타내세요.
#### - 부서이름, 사원이름, 사원직무, 입사일, 급여

In [172]:
emp_info = pd.merge(emp, dept, how='inner', on='deptno', right_index=True, sort=True)
emp_info[['dname', 'ename', 'job', 'hiredate', 'sal']]

         dname   ename        job   hiredate   sal
6   ACCOUNTING   CLARK    MANAGER 1981-06-09  2450
8   ACCOUNTING    KING  PRESIDENT 1981-11-17  5000
13  ACCOUNTING  MILLER      CLERK 1982-01-23  1300
0     RESEARCH   SMITH      CLERK 1980-12-17   800
3     RESEARCH   JONES    MANAGER 1981-04-02  2975
7     RESEARCH   SCOTT    ANALYST 1982-12-09  3000
10    RESEARCH   ADAMS      CLERK 1983-01-12  1100
12    RESEARCH    FORD    ANALYST 1981-12-03  3000
1        SALES   ALLEN   SALESMAN 1981-02-20  1600
2        SALES    WARD   SALESMAN 1981-02-22  1250
4        SALES  MARTIN   SALESMAN 1981-09-28  1250
5        SALES   BLAKE    MANAGER 1981-05-01  2850
9        SALES  TURNER   SALESMAN 1981-09-08  1500
11       SALES   JAMES      CLERK 1981-12-03   950

#### 5. 부서별 사원의 급여합, 급여평균을 보고하세요.

In [182]:
emp_sal = emp.groupby(['deptno'])
dept_sal = emp_sal['sal']

In [183]:
result = dept_sal.agg(['mean','sum'])
result

               mean    sum
deptno
10      2916.666667   8750
20      2175.000000  10875
30      1566.666667   9400

#### 6. 부서별 직무별 사원수, 급여합, 급여평균을 보고하세요

In [186]:
emp_sal2 = emp.groupby(['deptno','job'])
dept_sal2 = emp_sal2['sal']

In [187]:
result = dept_sal2.agg(['count', 'mean', 'sum'])
result

                  count  mean   sum
deptno job
10     CLERK          1  1300  1300
       MANAGER        1  2450  2450
       PRESIDENT      1  5000  5000
20     ANALYST        2  3000  6000
       CLERK          2   950  1900
       MANAGER        1  2975  2975
30     CLERK          1   950   950
       MANAGER        1  2850  2850
       SALESMAN       4  1400  5600

#### 7. 부서별 최상위 급여자를 출력하세요

In [195]:
emp_sal = emp.groupby(['deptno'])

In [202]:
def top(df, n=1, column='sal'):
    return df.sort_values(by=column)[-n:]

In [203]:
emp.groupby('deptno').apply(top)

           empno  ename        job     mgr   hiredate   sal  comm  deptno
deptno
10     8    7839   KING  PRESIDENT     NaN 1981-11-17  5000   NaN      10
20     12   7902   FORD    ANALYST  7566.0 1981-12-03  3000   NaN      20
30     5    7698  BLAKE    MANAGER  7839.0 1981-05-01  2850   NaN      30